# Objective : Data Merging and Melting (minute - wide)

### Importing Required Libraries ->

In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

### Load the Datasets ->

In [2]:
# Load datasets
minute_calories = pd.read_csv('minuteCaloriesWide_merged.csv')
minute_intensities = pd.read_csv('minuteIntensitiesWide_merged.csv')
minute_steps = pd.read_csv('minuteStepsWide_merged.csv')

### Preview the Datasets ->

In [3]:
# Inspect the first few rows and the column names of each dataset
datasets = [minute_calories, minute_intensities, minute_steps]
dataset_names = ['minute_calories', 'minute_intensities','minute_steps']

for name, dataset in zip(dataset_names, datasets):
    print(f"{name.upper()}:")
    print(dataset.head())
    print(dataset.columns.tolist())
    print("\n")

MINUTE_CALORIES:
           Id           ActivityHour  Calories00  Calories01  Calories02  \
0  1503960366  4/13/2016 12:00:00 AM      1.8876      2.2022      0.9438
1  1503960366   4/13/2016 1:00:00 AM      0.7865      0.7865      0.7865
2  1503960366   4/13/2016 2:00:00 AM      0.7865      0.7865      0.7865
3  1503960366   4/13/2016 3:00:00 AM      0.7865      0.7865      0.7865
4  1503960366   4/13/2016 4:00:00 AM      0.7865      0.7865      0.7865

   Calories03  Calories04  Calories05  Calories06  Calories07  ...  \
0      0.9438      0.9438      2.0449      0.9438      2.2022  ...
1      0.7865      0.9438      0.9438      0.9438      0.7865  ...
2      0.7865      0.7865      0.7865      0.7865      0.7865  ...
3      0.7865      0.7865      0.7865      0.7865      0.7865  ...
4      0.7865      0.7865      0.7865      0.7865      0.7865  ...

   Calories50  Calories51  Calories52  Calories53  Calories54  Calories55  \
0      0.9438      2.0449      2.0449      0.9438      2.3595      1.8876
1      0.7865      0.7865      0.7865      0.7865      0.7865      0.7865
2      0.7865      0.7865      0.7865      0.7865      0.7865      0.7865
3      0.7865      0.7865      0.7865      0.7865      0.7865      0.7865
4      0.7865      0.7865      0.7865      0.7865      0.7865      0.7865

   Calories56  Calories57  Calories58  Calories59
0      0.9438      0.9438      0.9438      0.9438
1      0.7865      0.7865      0.7865      0.7865
2      0.7865      0.7865      0.7865      0.7865
3      0.7865      0.7865      0.7865      0.7865
4      0.7865      0.7865      0.7865      0.7865

[5 rows x 62 columns]
['Id', 'ActivityHour', 'Calories00', 'Calories01', 'Calories02', 'Calories03', 'Calories04', 'Calories05', 'Calories06', 'Calories07', 'Calories08', 'Calories09', 'Calories10', 'Calories11', 'Calories12', 'Calories13', 'Calories14', 'Calories15', 'Calories16', 'Calories17', 'Calories18', 'Calories19', 'Calories20', 'Calories21', 'Calories22', 'Calories23', 'Calories24', 'Calories25', 'Calories26', 'Calories27', 'Calories28', 'Calories29', 'Calories30', 'Calories31', 'Calories32', 'Calories33', 'Calories34', 'Calories35', 'Calories36', 'Calories37', 'Calories38', 'Calories39', 'Calories40', 'Calories41', 'Calories42', 'Calories43', 'Calories44', 'Calories45', 'Calories46', 'Calories47', 'Calories48', 'Calories49', 'Calories50', 'Calories51', 'Calories52', 'Calories53', 'Calories54', 'Calories55', 'Calories56', 'Calories57', 'Calories58', 'Calories59']


MINUTE_INTENSITIES:
           Id           ActivityHour  Intensity00  Intensity01  Intensity02  \
0  1503960366  4/13/2016 12:00:00 AM            1            1            0
1  1503960366   4/13/2016 1:00:00 AM            0            0            0
2  1503960366   4/13/2016 2:00:00 AM            0            0            0
3  1503960366   4/13/2016 3:00:00 AM            0            0            0
4  1503960366   4/13/2016 4:00:00 AM            0            0            0

   Intensity03  Intensity04  Intensity05  Intensity06  Intensity07  ...  \
0            0            0            1            0            1  ...
1            0            0            0            0            0  ...
2            0            0            0            0            0  ...
3            0            0            0            0            0  ...
4            0            0            0            0            0  ...

   Intensity50  Intensity51  Intensity52  Intensity53  Intensity54  \
0            0            1            1            0            1
1            0            0            0            0            0
2            0            0            0            0            0
3            0            0            0            0            0
4            0            0            0            0            0

   Intensity55  Intensity56  Intensity57  Intensity58  Intensity59
0            1            0            0            0            0
1            0            0            0            0            0
2            0            0            0            0            0
3            0            0            0            0            0
4            0            0            0            0            0

[5 rows x 62 columns]
['Id', 'ActivityHour', 'Intensity00', 'Intensity01', 'Intensity02', 'Intensity03', 'Intensity04', 'Intensity05', 'Intensity06', 'Intensity07', 'Intensity08', 'Intensity09', 'Intensity10', 'Intensity11', 'Intensity12', 'Intensity13', 'Intensity14', 'Intensity15', 'Intensity16', 'Intensity17', 'Intensity18', 'Intensity19', 'Intensity20', 'Intensity21', 'Intensity22', 'Intensity23', 'Intensity24', 'Intensity25', 'Intensity26', 'Intensity27', 'Intensity28', 'Intensity29', 'Intensity30', 'Intensity31', 'Intensity32', 'Intensity33', 'Intensity34', 'Intensity35', 'Intensity36', 'Intensity37', 'Intensity38', 'Intensity39', 'Intensity40', 'Intensity41', 'Intensity42', 'Intensity43', 'Intensity44', 'Intensity45', 'Intensity46', 'Intensity47', 'Intensity48', 'Intensity49', 'Intensity50', 'Intensity51', 'Intensity52', 'Intensity53', 'Intensity54', 'Intensity55', 'Intensity56', 'Intensity57', 'Intensity58', 'Intensity59']


MINUTE_STEPS:
           Id           ActivityHour  Steps00  Steps01  Steps02  Steps03  \
0  1503960366  4/13/2016 12:00:00 AM        4       16        0        0
1  1503960366   4/13/2016 1:00:00 AM        0        0        0        0
2  1503960366   4/13/2016 2:00:00 AM        0        0        0        0
3  1503960366   4/13/2016 3:00:00 AM        0        0        0        0
4  1503960366   4/13/2016 4:00:00 AM        0        0        0        0

   Steps04  Steps05  Steps06  Steps07  ...  Steps50  Steps51  Steps52  \
0        0        9        0       17  ...        0        9        8
1        0        0        0        0  ...        0        0        0
2        0        0        0        0  ...        0        0        0
3        0        0        0        0  ...        0        0        0
4        0        0        0        0  ...        0        0        0

   Steps53  Steps54  Steps55  Steps56  Steps57  Steps58  Steps59
0        0       20        1        0        0        0        0
1        0        0        0        0        0        0        0
2        0        0        0        0        0        0        0
3        0        0        0        0        0        0        0
4        0        0        0        0        0        0        0

[5 rows x 62 columns]
['Id', 'ActivityHour', 'Steps00', 'Steps01', 'Steps02', 'Steps03', 'Steps04', 'Steps05', 'Steps06', 'Steps07', 'Steps08', 'Steps09', 'Steps10', 'Steps11', 'Steps12', 'Steps13', 'Steps14', 'Steps15', 'Steps16', 'Steps17', 'Steps18', 'Steps19', 'Steps20', 'Steps21', 'Steps22', 'Steps23', 'Steps24', 'Steps25', 'Steps26', 'Steps27', 'Steps28', 'Steps29', 'Steps30', 'Steps31', 'Steps32', 'Steps33', 'Steps34', 'Steps35', 'Steps36', 'Steps37', 'Steps38', 'Steps39', 'Steps40', 'Steps41', 'Steps42', 'Steps43', 'Steps44', 'Steps45', 'Steps46', 'Steps47', 'Steps48', 'Steps49', 'Steps50', 'Steps51', 'Steps52', 'Steps53', 'Steps54', 'Steps55', 'Steps56', 'Steps57', 'Steps58', 'Steps59']

In [4]:
# Enusure the shape of dataset before merging
print(minute_calories.shape)
print(minute_intensities.shape)
print(minute_steps.shape)

(21645, 62)
(21645, 62)
(21645, 62)

### Dataset Melting ->

In [5]:
# Perform the melting operation on 'minuteIntensitiesWide_merged' dataset
melted_data1 = pd.melt(minute_intensities, id_vars=['Id', 'ActivityHour'], var_name='Minute', value_name='Intensities')

# Adjust the 'Minute' column to extract the minute as a number
melted_data1['Minute'] = melted_data1['Minute'].str.extract('(\d+)').astype(int)

# Display the first few rows of the melted dataset
melted_data1.head()

           Id           ActivityHour  Minute  Intensities
0  1503960366  4/13/2016 12:00:00 AM       0            1
1  1503960366   4/13/2016 1:00:00 AM       0            0
2  1503960366   4/13/2016 2:00:00 AM       0            0
3  1503960366   4/13/2016 3:00:00 AM       0            0
4  1503960366   4/13/2016 4:00:00 AM       0            0

In [6]:
melted_data1.shape

(1298700, 4)

In [7]:
# Perform the melting operation on 'minuteCaloriesWide_merged' dataset
melted_data2 = pd.melt(minute_calories, id_vars=['Id', 'ActivityHour'], var_name='Minute', value_name='Calories')

# Adjust the 'Minute' column to extract the minute as a number
melted_data2['Minute'] = melted_data2['Minute'].str.extract('(\d+)').astype(int)

# Display the first few rows of the melted dataset
melted_data2.head()

           Id           ActivityHour  Minute  Calories
0  1503960366  4/13/2016 12:00:00 AM       0    1.8876
1  1503960366   4/13/2016 1:00:00 AM       0    0.7865
2  1503960366   4/13/2016 2:00:00 AM       0    0.7865
3  1503960366   4/13/2016 3:00:00 AM       0    0.7865
4  1503960366   4/13/2016 4:00:00 AM       0    0.7865

In [8]:
melted_data2.shape

(1298700, 4)

In [9]:
# Perform the melting operation 'minuteStepsWide_merged' dataset
melted_data3 = pd.melt(minute_steps, id_vars=['Id', 'ActivityHour'], var_name='Minute', value_name='Steps')

# Adjust the 'Minute' column to extract the minute as a number
melted_data3['Minute'] = melted_data3['Minute'].str.extract('(\d+)').astype(int)

# Display the first few rows of the melted dataset
melted_data3.head()

           Id           ActivityHour  Minute  Steps
0  1503960366  4/13/2016 12:00:00 AM       0      4
1  1503960366   4/13/2016 1:00:00 AM       0      0
2  1503960366   4/13/2016 2:00:00 AM       0      0
3  1503960366   4/13/2016 3:00:00 AM       0      0
4  1503960366   4/13/2016 4:00:00 AM       0      0

In [10]:
melted_data3.shape

(1298700, 4)

In [11]:
# Merge datasets: Start with minutely_calories as the base, then merge others one by one
# Using an outer join to ensure no data is missed
minute_merged_data_wide = melted_data1.merge(melted_data2, on=['Id', 'ActivityHour','Minute'], how='outer', suffixes=('', '_calories'))

# Merging minutely_steps
minute_merged_data_wide = minute_merged_data_wide.merge(melted_data3, on=['Id', 'ActivityHour','Minute'], how='outer', suffixes=('', '_steps'))

# Check for duplicates
duplicates = minute_merged_data_wide.duplicated().sum()

# Overview of the merged dataset
merged_overview = {
    'Number of rows': minute_merged_data_wide.shape[0],
    'Number of columns': minute_merged_data_wide.shape[1],
    'Number of duplicates': duplicates
}

print(merged_overview)
minute_merged_data_wide.head()

{'Number of rows': 1298700, 'Number of columns': 6, 'Number of duplicates': 0}

           Id           ActivityHour  Minute  Intensities  Calories  Steps
0  1503960366  4/13/2016 12:00:00 AM       0            1    1.8876      4
1  1503960366   4/13/2016 1:00:00 AM       0            0    0.7865      0
2  1503960366   4/13/2016 2:00:00 AM       0            0    0.7865      0
3  1503960366   4/13/2016 3:00:00 AM       0            0    0.7865      0
4  1503960366   4/13/2016 4:00:00 AM       0            0    0.7865      0

### Exporting the Dataset ->

In [12]:
minute_merged_data_wide.to_csv("minute_merged_data_wide.csv")